/*   19.8.8  15点07分
	 抓住三个过程： 流程  到 各部分功能 到 试数
	  试数时要 详细写 就假设自己就是计算机，根据一步一步的来写并且要规范
	  回文数 是 正着写与倒着写一样   如12321 
	  while 的用法
	     while(表达式) 
		 	语句 
		 	
	for(1;2;3)  一般都用for 
		A; 等价于
		
		1;
	while(2) 
	{
		A;
		3;	
	}


*/

# include <stdio.h>

int main(void)
{
	int val;//存放待判断的数字
	int m; 
	int sum = 0;
	
	printf("请输入您需要判断的数字");
	scanf("%d",&val); 
	
	m = val;
	while(m)//m是真即执行下面的 即m是非0即可 
	{
		sum = sum *10 + m % 10;
		m /= 10;
		
	}
	
	if(sum == val)
		printf("yes!\n");
	else
		printf("no!\n"); 
	
	return 0;
 } 
 /*
 	 试数过程（假如随便输一个数1234） 
 	 1、m = 1234 成立 
	  	sum = 0*10 + 1234%10 = 4
		m = m/10 = 123
	2、 m = 123 成立
		sum = 4*10 + 123%10 =  43
		m = m/10  = 12
	3、 m = 12 成立
		sum = 43*10 +12 % 10 = 432
		m = 12/10 = 1
	4、 m = 1成立
		sum= 432 * 10 + 1%10 = 4321
		m =1/10 = 0
	5、 m = 0 不成立 
	   
	   因此最终m= 4321 
 
 */ 
